[notebook](http://localhost:8888/notebooks/scripts/22.ipynb)

In [2]:
import pandas as pd
from IPython.display import display
pd.set_option('display.max_rows', 4)

In [3]:
# read a dataset of UFO reports into a DataFrame
ufo = pd.read_csv('../data/ufo.csv')
ufo

              City Colors Reported Shape Reported State              Time
0           Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1      Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
...            ...             ...            ...   ...               ...
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

[18241 rows x 5 columns]

In [4]:
ufo.shape

(18241, 5)

In [5]:
# drop: remove column but not change for real
ufo.drop('City', axis=1)

      Colors Reported Shape Reported State              Time
0                 NaN       TRIANGLE    NY    6/1/1930 22:00
1                 NaN          OTHER    NJ   6/30/1930 20:00
...               ...            ...   ...               ...
18239             RED          LIGHT    WI  12/31/2000 23:45
18240             NaN           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [6]:
ufo

              City Colors Reported Shape Reported State              Time
0           Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1      Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
...            ...             ...            ...   ...               ...
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

[18241 rows x 5 columns]

In [7]:
# drop: inplace change for real
ufo.drop('City', axis=1, inplace=True)

In [8]:
ufo

      Colors Reported Shape Reported State              Time
0                 NaN       TRIANGLE    NY    6/1/1930 22:00
1                 NaN          OTHER    NJ   6/30/1930 20:00
...               ...            ...   ...               ...
18239             RED          LIGHT    WI  12/31/2000 23:45
18240             NaN           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [9]:
# inplace: False, not for real
ufo.dropna(how='any').shape

(2490, 4)

In [10]:
ufo.shape

(18241, 4)

In [11]:
ufo = ufo.set_index('Time')
ufo.tail()

                 Colors Reported Shape Reported State
Time
12/31/2000 23:00             NaN       TRIANGLE    IL
12/31/2000 23:00             NaN           DISK    IA
...                          ...            ...   ...
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:59             NaN           OVAL    FL

[5 rows x 3 columns]

In [12]:
# fillna
# method='bfill': fill backward
ufo['Colors Reported'].fillna(method='bfill').tail()

Time
12/31/2000 23:00    RED
12/31/2000 23:00    RED
                   ...
12/31/2000 23:45    RED
12/31/2000 23:59    NaN
Name: Colors Reported, dtype: object

In [13]:
ufo.fillna(method='bfill').tail()

                 Colors Reported Shape Reported State
Time
12/31/2000 23:00             RED       TRIANGLE    IL
12/31/2000 23:00             RED           DISK    IA
...                          ...            ...   ...
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:59             NaN           OVAL    FL

[5 rows x 3 columns]

In [14]:
# method='ffill'
ufo.fillna(method='ffill').tail(10)

                 Colors Reported Shape Reported State
Time
12/31/2000 20:00            BLUE           OVAL    CA
12/31/2000 20:30            BLUE           OVAL    WI
...                          ...            ...   ...
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:59             RED           OVAL    FL

[10 rows x 3 columns]

[<a href="#Python-pandas-Q&A-video-series-by-Data-School">Back to top</a>]